# running in wishbone_basic/src/
read -formal top_level.sv
read -sv input_fifo.sv
prep -top wishbone_nn

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
