# running in fifo_nofullskip/src/
read -define NO_FULL_SKIP=1
read -formal input_fifo.sv
prep -top fifo_buffer

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
