# running in wishbone_nofullskip/src/
read -define NO_FULL_SKIP=1
read -formal top_level.sv
read -formal input_fifo.sv
prep -top wishbone_nn

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
